[
  {
    "id": 1,
    "name": "Rocky Baalboa",
    "age": 5,
    "breed": "Dorset",
    "woolColor": "White",
    "isSheared": false,
    "weight": 85,
    "healthStatus": "Healthy",
    "imageUrl": "./assets/images/rocky.webp",
    "description": "Rocky Baalboa is a tough and determined sheep, known for his incredible resilience and stamina. He grew up on the rugged hills, where he learned to face every challenge head-on, never backing down from a fight. Whether it’s braving the cold winters or leading his flock, Rocky is always at the front, inspiring others with his grit and determination. His muscular build and powerful stride make him a natural leader among the flock, and he’s well-respected by both sheep and shepherd alike.\n\nAlthough he may seem rough on the outside, Rocky has a softer side too. He enjoys peaceful moments grazing in the fields, and despite his strength, he’s a gentle giant when it comes to his companions. His thick, white wool is as iconic as his tenacity, and though he’s not sheared often, his coat is a prized possession when he does. Rocky may be a fighter, but he’s also a protector, always watching out for those around him.",
    "temperament": "Aggressive"
  },
  {
    "id": 2,
    "name": "Anne HathaWool",
    "age": 4,
    "breed": "Merino",
    "woolColor": "Cream",
    "isSheared": true,
    "weight": 72,
    "healthStatus": "Healthy",
    "imageUrl": "./assets/images/anne.webp",
    "description": "Anne HathaWool is the epitome of elegance and grace among the sheep. Her Merino breed is known for producing some of the finest wool in the world, and Anne lives up to that reputation with her beautifully soft, cream-colored fleece. She moves with a regal air, always composed and sophisticated, making her the center of attention wherever she grazes. Despite her refined demeanor, Anne is warm and approachable, often found nurturing younger lambs in the flock with motherly care.\n\nAnne's wool is highly sought after, and she’s become something of a celebrity in the shearing season, with her fleece fetching top prices at market. She takes her grooming seriously, and even after being sheared, she maintains a stunning appearance. Anne HathaWool is not only beautiful but also a symbol of tradition, with her Merino heritage linking her to centuries of wool craftsmanship.",
    "temperament": "Calm"
  },
  {
    "id": 3,
    "name": "Lady Baabaa",
    "age": 3,
    "breed": "Suffolk",
    "woolColor": "Black and White",
    "isSheared": false,
    "weight": 78,
    "healthStatus": "Healthy",
    "imageUrl": "./assets/images/baba.webp",
    "description": "Lady Baabaa is known for her distinct, stylish appearance, with her black-and-white Suffolk fleece making her stand out in any field. She’s the fashion icon of the flock, always impeccably groomed and never missing a chance to show off her chic look. Lady Baabaa is proud of her heritage, hailing from a long line of Suffolk sheep known for their striking wool patterns and strong build. Her playful nature and love for attention make her a favorite among visitors to the farm, where she’s often the star of the show.\n\nDespite her love for the spotlight, Lady Baabaa is more than just looks. She’s intelligent and resourceful, often leading her companions to the best grazing spots. Her strong Suffolk roots give her an edge in both appearance and durability, allowing her to thrive in various conditions. Lady Baabaa is the perfect mix of beauty and brains, always ready for the next adventure in style.",
    "temperament": "Playful"
  },
  {
    "id": 4,
    "name": "Ed Shear-an",
    "age": 2,
    "breed": "Cheviot",
    "woolColor": "Reddish Brown",
    "isSheared": true,
    "weight": 70,
    "healthStatus": "Healthy",
    "imageUrl": "./assets/images/ed.webp",
    "description": "Ed Shear-an is a gentle and creative soul, known for his reddish-brown Cheviot fleece that has a natural warmth and vibrancy. His fleece is as distinctive as his personality, full of charm and appeal. Ed is a bit of a daydreamer, often found wandering the fields humming to himself, lost in his own world of melodies and stories. Though young, he has an old soul and enjoys the simple pleasures of life, like grazing under the shade of a tree or watching the sunset over the hills.\n\nDespite his relaxed demeanor, Ed Shear-an takes shearing season seriously, as his fleece is highly prized for its rich color and quality. He’s become a favorite among shearers, who appreciate both his cooperative nature and the beauty of his wool. Ed might be quiet, but his presence in the flock is undeniable, bringing a sense of calm and creativity wherever he goes.",
    "temperament": "Curious"
  },
  {
    "id": 5,
    "name": "Ewe'n McGregor",
    "age": 6,
    "breed": "Texel",
    "woolColor": "White",
    "isSheared": false,
    "weight": 90,
    "healthStatus": "Minor Injury (Healing)",
    "imageUrl": "./assets/images/ewan.webp",
    "description": "Ewe'n McGregor is the bold adventurer of the flock, always up for a challenge and never afraid to explore new terrain. His Texel heritage gives him a strong, muscular build, and he’s known for his bravery in leading the flock through difficult terrain. Ewe'n recently suffered a minor injury while scaling a rocky hillside, but true to his nature, he’s recovering quickly and is eager to get back to his daring escapades. His pristine white wool reflects his noble spirit, standing out against the rugged landscapes he loves to traverse.\n\nThough he’s often seen at the front of the flock, guiding them with confidence, Ewe'n also has a softer side. He enjoys moments of rest, reflecting on his journeys and planning his next great adventure. His presence is reassuring to the other sheep, who know they’re in good hands with Ewe'n watching over them. As he heals, he’s already dreaming of his next expedition into uncharted pastures.",
    "temperament": "Aggressive"
  },
  {
    "id": 6,
    "name": "Fleece Witherspoon",
    "age": 4,
    "breed": "Romney",
    "woolColor": "Golden",
    "isSheared": true,
    "weight": 76,
    "healthStatus": "Healthy",
    "imageUrl": "./assets/images/fleece.webp",
    "description": "Fleece Witherspoon is a lively and outgoing sheep, always ready to make new friends and charm everyone around her. Her golden Romney fleece is as bright as her personality, radiating warmth and joy wherever she goes. Fleece is known for her quick wit and playful nature, often the life of the flock with her energetic antics. She has a reputation for being the first to greet visitors at the farm, always eager to interact and show off her stunning fleece.\n\nThough she enjoys the limelight, Fleece takes great pride in her wool, which is soft, luxurious, and highly sought after. She’s been through many shearing seasons, and each time, her golden fleece is in high demand. Fleece Witherspoon embodies the perfect balance of fun and sophistication, making her a beloved member of the flock and a standout in both personality and appearance.",
    "temperament": "Playful"
  },
  {
    "id": 7,
    "name": "Shearlock Holmes",
    "age": 5,
    "breed": "Lincoln",
    "woolColor": "Gray",
    "isSheared": false,
    "weight": 80,
    "healthStatus": "Healthy",
    "imageUrl": "./assets/images/holmes.webp",
    "description": "Shearlock Holmes is the most curious and intelligent sheep in the flock, always investigating his surroundings and finding clever ways to solve problems. His gray Lincoln fleece gives him a distinguished, scholarly appearance, perfectly matching his thoughtful nature. Shearlock is known for his keen observational skills, often noticing things that others miss. Whether it’s leading the flock to hidden grazing spots or figuring out how to navigate obstacles, he’s the go-to sheep for solutions.\n\nDespite his serious demeanor, Shearlock has a playful side, especially when he’s deep in thought. He can often be seen pacing around, seemingly pondering the mysteries of the world. His analytical mind is highly respected among the flock, and even the shepherds rely on him for insights into the flock’s wellbeing. With his sharp mind and unique look, Shearlock Holmes is a truly remarkable sheep.",
    "temperament": "Curious"
  },
  {
    "id": 8,
    "name": "Baarack Obaama",
    "age": 5,
    "breed": "Lincoln",
    "woolColor": "Black",
    "isSheared": false,
    "weight": 85,
    "healthStatus": "Healthy",
    "imageUrl": "./assets/images/barak.webp",
    "description": "Baarack Obaama is a sheep of dignity and leadership, always calm and collected no matter the situation. His black Lincoln wool is thick and luxurious, adding to his impressive stature. Baarack leads by example, with a quiet but strong presence that commands respect from the rest of the flock. He is often seen calmly grazing or watching over the others, always ensuring the safety and harmony of the flock.\n\nBaarack's wool is highly valued, both for its quality and color, and despite his large size, he is known for his gentle nature. His calm and calculated approach to challenges makes him a trusted figure among the flock, and the shepherd relies on him to keep the other sheep in line. Baarack may not be the most vocal, but his actions speak louder than words, and the flock looks up to him as a true leader.",
    "temperament": "Calm"
  }
]